#ifndef DCD_SNPS
#define DCD_SNPS
/*
===========================================================================

FILE:         dcd_snps.h

DESCRIPTION:  
This is the external interface for the HS-USB core default implementation.

$Header: //components/rel/core.tx/6.0/wiredconnectivity/hsusb/core/src/jslave/dcd/dcd_snps.h#2 $

===========================================================================

===========================================================================
Copyright © 2010, 2023 Qualcomm Technologies Incorporated.
All Rights Reserved.
QUALCOMM Proprietary/GTDR
===========================================================================
*/

#include <jos_int.h>
#include <jusb_common_int.h>
#include <lists.h>
#include <jusb_core.h>
#include "hsu_common_int.h"
#include "hsu_hwio_dependency.h"
#include "hsu_al_bam_utils.h"
#include "hsu_timer.h"
#include "hsu_log.h"

/*==============================================================================
Constants and Macros
==============================================================================*/

/*==============================================================================
Definitions
==============================================================================*/
// 1 for control and 3 for GSI == 4
#define SNPS_DCD_MAX_NUM_EVENT_BUF    1

/*=============================== Registers Defs =============================*/

#define SNPS_DCD_DSTS_CONNECTSPD_SS                 0x4

#define SNPS_DCD_DSTS_CONNECTSPD_FS                 0x1
#define SNPS_DCD_DSTS_CONNECTSPD_LS                 0x2
#define SNPS_DCD_DSTS_CONNECTSPD_FS_PHY_48MHZ       0x3

#define SNPS_DCD_DCFG_DEVSPD_HS       0x0
#define SNPS_DCD_DCFG_DEVSPD_SS       0x4
#ifdef FEATURE_HS_USB_BURST_MODE
#define SNPS_DCD_DCFG_DEFAULT_NUMP    0x5
#else // ~FEATURE_HS_USB_BURST_MODE
#define SNPS_DCD_DCFG_DEFAULT_NUMP    0x1
#endif // ~FEATURE_HS_USB_BURST_MODE

#define SNPS_DCD_DEVTEN_DISCONNEVTEN   0x00000001
#define SNPS_DCD_DEVTEN_USBRSTEN       0x00000002
#define SNPS_DCD_DEVTEN_CONNECTDONEEN  0x00000004
#define SNPS_DCD_DEVTEN_ULSCNGEN       0x00000008
#define SNPS_DCD_DEVTEN_WKUPEVTEN      0x00000010
#define SNPS_DCD_DEVTEN_HIBERNANTION   0x00000020
#define SNPS_DCD_DEVTEN_U3L2L1         0x00000040
#define SNPS_DCD_DEVTEN_ERRTICERR      0x00000200
#define SNPS_DCD_DEVTEN_DEFAULT \
  SNPS_DCD_DEVTEN_DISCONNEVTEN | SNPS_DCD_DEVTEN_USBRSTEN | SNPS_DCD_DEVTEN_CONNECTDONEEN | \
  /* SNPS_DCD_DEVTEN_ULSCNGEN | */ SNPS_DCD_DEVTEN_WKUPEVTEN | SNPS_DCD_DEVTEN_HIBERNANTION | \
  SNPS_DCD_DEVTEN_U3L2L1 | SNPS_DCD_DEVTEN_ERRTICERR
//  TODO : FEATURE_HS_USB_PRE_SILICON_BU SNPS_DCD_DEVTEN_CMDCMPLEN | SNPS_DCD_DEVTEN_EVNTOVRFLWEN 

#define SNPS_DCD_GUSB2PHYCFG_USBTRDTIM_16BITS    0x5
#define SNPS_DCD_GUSB2PHYCFG_USBTRDTIM_8BITS     0x9

#define SNPS_DCD_GCTL_PRTCAPDIR_DEVICE           0x2
#define SNPS_DCD_GCTL_PWRDNSCALE_DEFAULT         0x3D2

/*====================== Controller Defs & Structs  ==========================*/

#define SNPS_DCD_DEPCMD_CMDTYPE_SETEPCONF       0x1
#define SNPS_DCD_DEPCMD_CMDTYPE_SETEPXFERRES    0x2
#define SNPS_DCD_DEPCMD_CMDTYPE_GETEPSTATE      0x3
#define SNPS_DCD_DEPCMD_CMDTYPE_SETSTALL        0x4
#define SNPS_DCD_DEPCMD_CMDTYPE_CLEARSTALL      0x5
#define SNPS_DCD_DEPCMD_CMDTYPE_STARTTRANSFER   0x6
#define SNPS_DCD_DEPCMD_CMDTYPE_UPDATETRANSFER  0x7
#define SNPS_DCD_DEPCMD_CMDTYPE_ENDTRANSFER     0x8
#define SNPS_DCD_DEPCMD_CMDTYPE_STARTNEWCFG     0x9

// Device Generic Command Descriptors
#define SNPS_DCD_DGCMD_CMDTYPE_SET_PERIODIC_PARAMS                    0x2
#define SNPS_DCD_DGCMD_CMDTYPE_SET_SCRATCHPAD_BUFFER_ARRAY_ADDRESS_LO 0x4
#define SNPS_DCD_DGCMD_CMDTYPE_SET_SCRATCHPAD_BUFFER_ARRAY_ADDRESS_HI 0x5
#define SNPS_DCD_DGCMD_CMDTYPE_TRANSMIT_DEVICE_NOTIFICATION           0x7
#define SNPS_DCD_DGCMD_CMDTYPE_SELECTED_FIFO_FLUSH                    0x9
#define SNPS_DCD_DGCMD_CMDTYPE_ALL_FIFO_FLUSH                         0xA
#define SNPS_DCD_DGCMD_CMDTYPE_SET_ENDPOINT_NDRY                      0xC
#define SNPS_DCD_DGCMD_CMDTYPE_RUN_SOC_BUS_LOOPBACK_TEST              0x10

// +++Command 0x7 notification specifics DGCMDPAR for function wakeup
// DGCMDPAR[3:0] = 1 for function wake
#define SNPS_DCD_DGCMD_FUNCTION_WAKE_MASK       0x1
#define SNPS_DCD_DGCMD_FUNCTION_WAKE_SHFT       0x0

// DGCMDPAR[10:4] = Interface Number for function wake
#define SNPS_DCD_DGCMD_FUNCTION_WAKE_IFACE_MASK 0x7F0
#define SNPS_DCD_DGCMD_FUNCTION_WAKE_IFACE_SHFT 0x4
// ---

/* structures for the commands */
typedef struct
{
  juint32_t IntrNum:5;      /* 0:4 */
  juint32_t reserved1:3;    /* 5:7 */
  juint32_t XferCmplEn:1;   /* 8 */
  juint32_t XferInProgEn:1; /* 9 */
  juint32_t XferNRdyEn:1;   /* 10 */
  juint32_t reserved2:2;    /* 11:12 */
  juint32_t StreamEvtEn:1;  /* 13 */
  juint32_t reserved3:1;    /* 14 */
  juint32_t Ebc_used:1;     /* 15 */
  juint32_t bInterval_m1:8; /* 16:23 */
  juint32_t StrmCap:1;      /* 24 */
  juint32_t EpDir:1;        /* 25 */
  juint32_t LEP:4;          /* 26:29 */
  juint32_t BulkBased:1;    /* 30 */
  juint32_t FifoBased:1;    /* 31 */
} snps_dcd_DEPCFG_P1;  //cannot find def HWIO_DEPCMDPAR2_REGS_p_DEPCMDPAR1_OUTI

typedef struct
{
  juint32_t reserved1:1;    /* 0 */
  juint32_t EPType:2;       /* 1:2 */
  juint32_t MPS:11;         /* 3:13 */
  juint32_t reserved2:3;    /* 14:16 */
  juint32_t FIFONum:5;      /* 17:21 */
  juint32_t BrstSiz:4;      /* 22:25 */
  juint32_t reserved3:4;    /*26:29*/
  juint32_t CfgAction:2;    /* 30:31 */
} snps_dcd_DEPCFG_P0;  //cannot find def  HWIO_DEPCMDPAR2_REGS_p_DEPCMDPAR0_OUTI

typedef struct
{
  juint32_t NumXferRes:16;  /* 0:15 */
  juint32_t reserved:16;    /* 16:31 */
} snps_dcd_DEPXFERCFG_P0;  

typedef struct
{
  juint32_t TDAddrLow:32;
} snps_dcd_DEPSTRTXFER_P1;

typedef struct
{
  juint32_t TDAddrHigh:32;
} snps_dcd_DEPSTRTXFER_P0;

typedef union
{
  juint32_t value;
  snps_dcd_DEPCFG_P1 DEPCFG;
  snps_dcd_DEPSTRTXFER_P1 DEPSTRTXFER;
} snps_dcd_DEPCMD_P1;

typedef union
{
  juint32_t value;
  snps_dcd_DEPCFG_P0 DEPCFG;
  snps_dcd_DEPXFERCFG_P0 DEPXFERCFG;
  snps_dcd_DEPSTRTXFER_P0 DEPSTRTXFER;
} snps_dcd_DEPCMD_P0;

typedef struct
{
  juint32_t SystemExitLatency:10;  /* 0:9 */
  juint32_t resreved:22;           /* 10:31 */
} snps_dcd_DGCMD_SET_PERIODIC_PARAMS; 

typedef union
{
  juint32_t value;
  snps_dcd_DGCMD_SET_PERIODIC_PARAMS DGCMD_SET_PERIODIC_PARAMS;
} snps_dcd_DGCMDPAR;  //HWIO_DGCMDPAR_OUTM

#define SNPS_EP_XFER_RSC_INDEX_BMASK 0x7F
#define SNPS_BUS_TIME_EXPIRY_BMSK   0x2
#define SNPS_BUS_TIME_EXPIRY_SHFT   0x1

// DEPEVT in response to a STARTXFER command
#define SNPS_NO_XFER_RESOURCE_AVAIL_BMSK    0x1
#define SNPS_NO_XFER_RESOURCE_AVAIL_SHFT    0x0

/* TRB types */
typedef enum
{
  TRB_CONTROL_NORMAL           = 1,
  TRB_CONTROL_CONTROL_SETUP    = 2,
  TRB_CONTROL_CONTROL_STATUS_2 = 3,
  TRB_CONTROL_CONTROL_STATUS_3 = 4,
  TRB_CONTROL_CONTROL_DATA     = 5,
  TRB_CONTROL_ISOC_FIRST       = 6,
  TRB_CONTROL_ISOC             = 7,
  TRB_CONTROL_LINK             = 8
} snps_dcd_trb_type;

typedef enum
{
  SNPS_CTRL_STATE_UNKNOWN = 0,
  SNPS_CTRL_STATE_SETUP_START,
  SNPS_CTRL_STATE_SETUP_RCVD,
  SNPS_CTRL_STATE_DATA_OR_STATUS2,
  SNPS_CTRL_STATE_DATA_INTERPRETE,
  SNPS_CTRL_STATE_STATUS3_IN,
  SNPS_CTRL_STATE_STATUS3_OUT,
} snps_dcd_ctrl_state_type;

#define HSU_DBM_BPTRH_EP_NUM_BMSK     0x1F000000
#define HSU_DBM_BPTRH_EP_NUM_SHFT     24
#define HSU_DBM_BPTRH_TRB_DMA_BMSK    0x20000000
#define HSU_DBM_BPTRH_TRB_DMA_SHFT    29
#define HSU_DBM_BPTRH_DBM_BMSK        0x80000000
#define HSU_DBM_BPTRH_DBM_SHFT        31

/* The structure of the TRB */
typedef struct
{
  struct
  {
    juint32_t BPTRL:32;
  } WORD0;
  struct
  {
    juint32_t BPTRH:32;
  } WORD1;
  struct
  {
    juint32_t BUFSIZE:24;   /* 0:23 */
    juint32_t PCM1:2;       /* 24:25 */
    juint32_t reserved:2;   /* 26:27 */
    juint32_t TRBSTS:4;     /* 28:31 */
  } WORD2;
  struct
  {
    juint32_t HWO:1;        /* 0 */
    juint32_t LST:1;        /* 1 */
    juint32_t CHN:1;        /* 2 */
    juint32_t CSP:1;        /* 3 */
    juint32_t TRBCTL:6;     /* 4:9 */
    juint32_t ISP:1;        /* 10 */
    juint32_t IOC:1;        /* 11 */
    juint32_t reserved1:2;  /* 12:13 */
    juint32_t StrmID_SOFNum:16; /* 14:29 */
    juint32_t reserved2:2;  /* 30:31 */
  } WORD3;
} snps_dcd_trb;

/* Event structures */
typedef union
{
  juint32_t value;
  struct
  {
    juint32_t EPEvt:1;        /* 0 */
    juint32_t PhysicalEPNum:5;/* 1:5 */
    juint32_t type:4;         /* 6:9 */
    juint32_t reserved1:2;    /* 10:11 */
    juint32_t EventStatus:4;  /* 12:15 */
    juint32_t EventParam:16;  /* 16:31 */
  } DEPEVT;
  struct
  {
    juint32_t NonEPEvt:1;     /* 0 */
    juint32_t DEVEvt:7;       /* 1:7 */
    juint32_t type:4;         /* 8:11 */
    juint32_t reserved1:4;    /* 12:15 */
    juint32_t EvtInfo:9;      /* 16:24 */
    juint32_t reserved2:7;    /* 25:31 */
  } DEVT;
} snps_dcd_event_t;

/* Types of events */
#define SNPS_DCD_DEVT_DISCONNEVTEN    0
#define SNPS_DCD_DEVT_USBRSTEN        1
#define SNPS_DCD_DEVT_CONNECTDONEEN   2
#define SNPS_DCD_DEVT_ULSCNGEN        3
